In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {"Name":["Ali","Sara","John","Meera"], "Age":[25,28,23,30], "Salary":[50000,60000,55000,70000]}
df = pd.DataFrame(data)
df

    Name  Age  Salary
0    Ali   25   50000
1   Sara   28   60000
2   John   23   55000
3  Meera   30   70000

In [4]:
df[:3]

   Name  Age  Salary
0   Ali   25   50000
1  Sara   28   60000
2  John   23   55000

In [5]:
df.iloc[:3]

   Name  Age  Salary
0   Ali   25   50000
1  Sara   28   60000
2  John   23   55000

In [6]:
df.loc[:,"Age"]

0    25
1    28
2    23
3    30
Name: Age, dtype: int64

In [7]:
df[df["Age"] > 25]

    Name  Age  Salary
1   Sara   28   60000
3  Meera   30   70000

In [8]:
df[(df["Salary"] > 55000) & (df["Salary"] < 70000)]

   Name  Age  Salary
1  Sara   28   60000

In [9]:
df.iloc[:3, [0,2]]

   Name  Salary
0   Ali   50000
1  Sara   60000
2  John   55000

In [10]:
df.loc[2:5,["Name","Age"]]

    Name  Age
2   John   23
3  Meera   30

In [11]:
df[::2]

   Name  Age  Salary
0   Ali   25   50000
2  John   23   55000

In [12]:
df.iloc[:,-2:]

   Age  Salary
0   25   50000
1   28   60000
2   23   55000
3   30   70000

In [13]:
df[(df["Age"] < 30) & (df["Salary"] > 55000)]

   Name  Age  Salary
1  Sara   28   60000

In [14]:
df[df["Name"].str.startswith(("S","M"))]

    Name  Age  Salary
1   Sara   28   60000
3  Meera   30   70000

In [15]:
df[(df["Dept"] == "IT") | (df["Dept"] == "Finance")]

KeyError: 'Dept'

In [ ]:
df[(df["Age"] != 25)]

    Name  Age  Salary
1   Sara   28   60000
2   John   23   55000
3  Meera   30   70000

In [ ]:
df.loc[:, ["Name","Salary"]]

    Name  Salary
0    Ali   50000
1   Sara   60000
2   John   55000
3  Meera   70000

In [ ]:
filtered_df = df[df["Name"].str.contains("a", case=False)]
print(filtered_df)

    Name  Age  Salary
0    Ali   25   50000
1   Sara   28   60000
3  Meera   30   70000

In [ ]:
data = {
    "Name": ["Ali", None, "John", None, "Mohan", "Meera"],
    "Age": [25, None, None, 23, None, 30],
    "Salary": [50000, None, 55000, 60000, 58000, None],
    "Dept": ["IT", None, "Finance", None, "IT", "Sales"]
}
df = pd.DataFrame(data)
df

    Name   Age   Salary     Dept
0    Ali  25.0  50000.0       IT
1   None   NaN      NaN     None
2   John   NaN  55000.0  Finance
3   None  23.0  60000.0     None
4  Mohan   NaN  58000.0       IT
5  Meera  30.0      NaN    Sales

In [ ]:
df.isnull()

    Name    Age  Salary   Dept
0  False  False   False  False
1   True   True    True   True
2  False   True   False  False
3   True  False   False   True
4  False   True   False  False
5  False  False    True  False

In [ ]:
df.fillna(0)

    Name   Age   Salary     Dept
0    Ali  25.0  50000.0       IT
1      0   0.0      0.0        0
2   John   0.0  55000.0  Finance
3      0  23.0  60000.0        0
4  Mohan   0.0  58000.0       IT
5  Meera  30.0      0.0    Sales

In [ ]:
df.dropna()

  Name   Age   Salary Dept
0  Ali  25.0  50000.0   IT

In [ ]:
df

    Name   Age   Salary     Dept
0    Ali  25.0  50000.0       IT
1   None   NaN      NaN     None
2   John   NaN  55000.0  Finance
3   None  23.0  60000.0     None
4  Mohan   NaN  58000.0       IT
5  Meera  30.0      NaN    Sales

In [ ]:
df.dropna(how="all")

    Name   Age   Salary     Dept
0    Ali  25.0  50000.0       IT
2   John   NaN  55000.0  Finance
3   None  23.0  60000.0     None
4  Mohan   NaN  58000.0       IT
5  Meera  30.0      NaN    Sales

In [ ]:
df["Salary"].fillna(df["Salary"].mean())

0    50000.0
1    55750.0
2    55000.0
3    60000.0
4    58000.0
5    55750.0
Name: Salary, dtype: float64

In [ ]:
df["Age"].fillna(df["Age"].median())

0    25.0
1    25.0
2    25.0
3    23.0
4    25.0
5    30.0
Name: Age, dtype: float64

In [ ]:
df.dropna(thresh=1)

    Name   Age   Salary     Dept
0    Ali  25.0  50000.0       IT
2   John   NaN  55000.0  Finance
3   None  23.0  60000.0     None
4  Mohan   NaN  58000.0       IT
5  Meera  30.0      NaN    Sales

In [ ]:
df["Age"] = df["Age"].ffill()

In [ ]:
df

    Name   Age   Salary     Dept
0    Ali  25.0  50000.0       IT
1   None  25.0      NaN     None
2   John  25.0  55000.0  Finance
3   None  23.0  60000.0     None
4  Mohan  23.0  58000.0       IT
5  Meera  30.0      NaN    Sales

In [ ]:
df["Salary"].fillna(df["Salary"].mean())

0    50000
1    60000
2    55000
3    70000
Name: Salary, dtype: int64

In [ ]:

np.random.seed(0)


n = 100
departments = ["IT", "Finance", "HR", "Sales", "Marketing", None]
names = [f"Emp{i}" for i in range(1, n+1)]

data = {
    "EmpID": range(1, n+1),
    "Name": names,
    "Dept": np.random.choice(departments, n),
    "Age": np.random.randint(22, 60, n).astype(float),
    "Salary": np.random.randint(40000, 120000, n).astype(float),
    "ExperienceYears": np.random.randint(0, 20, n).astype(float),
    "JoiningDate": pd.date_range("2015-01-01", periods=n, freq='180D')
}

df = pd.DataFrame(data)


for col in ["Dept", "Age", "Salary", "ExperienceYears"]:
    df.loc[df.sample(frac=0.1, random_state=1).index, col] = np.nan


df.head(10)

   EmpID   Name       Dept   Age    Salary  ExperienceYears JoiningDate
0      1   Emp1  Marketing  58.0   78429.0             19.0  2015-01-01
1      2   Emp2       None  56.0  116323.0              3.0  2015-06-30
2      3   Emp3         IT  51.0  100809.0              9.0  2015-12-27
3      4   Emp4      Sales  25.0   42121.0             18.0  2016-06-24
4      5   Emp5      Sales  56.0   85353.0              2.0  2016-12-21
5      6   Emp6      Sales  35.0   43886.0             19.0  2017-06-19
6      7   Emp7    Finance  43.0   81690.0             11.0  2017-12-16
7      8   Emp8      Sales  31.0  115523.0             18.0  2018-06-14
8      9   Emp9       None  22.0   45181.0             13.0  2018-12-11
9     10  Emp10         HR  32.0   83349.0              1.0  2019-06-09

In [ ]:
df["Age"].fillna(df["Age"].median())

0     58.0
1     56.0
2     51.0
3     25.0
4     56.0
      ...
95    49.0
96    41.0
97    47.0
98    45.0
99    42.0
Name: Age, Length: 100, dtype: float64

In [ ]:
df.fillna({"Dept": "unknown"}, inplace=True)
df

    EmpID    Name       Dept   Age    Salary  ExperienceYears JoiningDate
0       1    Emp1  Marketing  58.0   78429.0             19.0  2015-01-01
1       2    Emp2    unknown  56.0  116323.0              3.0  2015-06-30
2       3    Emp3         IT  51.0  100809.0              9.0  2015-12-27
3       4    Emp4      Sales  25.0   42121.0             18.0  2016-06-24
4       5    Emp5      Sales  56.0   85353.0              2.0  2016-12-21
..    ...     ...        ...   ...       ...              ...         ...
95     96   Emp96    Finance  49.0  102746.0              0.0  2061-10-26
96     97   Emp97      Sales  41.0   73354.0             13.0  2062-04-24
97     98   Emp98         IT  47.0  119668.0             19.0  2062-10-21
98     99   Emp99    unknown  45.0   94254.0              9.0  2063-04-19
99    100  Emp100         IT  42.0   47601.0              5.0  2063-10-16

[100 rows x 7 columns]

In [ ]:
df[(df["Dept"] == "IT") | (df["Dept"] == "Finance")].head(10)

    EmpID   Name     Dept   Age    Salary  ExperienceYears JoiningDate
2       3   Emp3       IT  51.0  100809.0              9.0  2015-12-27
6       7   Emp7  Finance  43.0   81690.0             11.0  2017-12-16
11     12  Emp12       IT  24.0   82914.0             10.0  2020-06-03
12     13  Emp13       IT  56.0  110744.0             16.0  2020-11-30
15     16  Emp16  Finance  25.0  110399.0             17.0  2022-05-24
16     17  Emp17       IT  40.0   87394.0             10.0  2022-11-20
19     20  Emp20  Finance  39.0  103413.0             13.0  2024-05-13
21     22  Emp22       IT  36.0   70142.0              6.0  2025-05-08
22     23  Emp23  Finance  23.0   72904.0              7.0  2025-11-04
25     26  Emp26       IT  44.0   99601.0              7.0  2027-04-28

In [ ]:
df[(df["Salary"] > 50000) & (df["Salary"] < 80000)].head(10)

    EmpID   Name       Dept   Age   Salary  ExperienceYears JoiningDate
0       1   Emp1  Marketing  58.0  78429.0             19.0  2015-01-01
21     22  Emp22         IT  36.0  70142.0              6.0  2025-05-08
22     23  Emp23    Finance  23.0  72904.0              7.0  2025-11-04
23     24  Emp24  Marketing  58.0  66813.0              8.0  2026-05-03
24     25  Emp25      Sales  32.0  79041.0             13.0  2026-10-30
29     30  Emp30         HR  54.0  75620.0              3.0  2029-04-17
38     39  Emp39    Finance  56.0  62597.0              4.0  2033-09-23
39     40  Emp40    Finance  35.0  65484.0             12.0  2034-03-22
42     43  Emp43         HR  53.0  51605.0              5.0  2035-09-13
45     46  Emp46      Sales  24.0  62571.0             19.0  2037-03-06

In [ ]:
df["SalaryAfterBonus"] = df["Salary"] + 0.1 * df["Salary"]
df.head()

,EmpID,Name,Dept,Age,Salary,ExperienceYears,JoiningDate,SalaryAfterBonus
0,1,Emp1,Marketing,58.0,78429.0,19.0,2015-01-01,86271.9
1,2,Emp2,unknown,56.0,116323.0,3.0,2015-06-30,127955.3
2,3,Emp3,IT,51.0,100809.0,9.0,2015-12-27,110889.9
3,4,Emp4,Sales,25.0,42121.0,18.0,2016-06-24,46333.1
4,5,Emp5,Sales,56.0,85353.0,2.0,2016-12-21,93888.3

## Customer Transactions

In [ ]:
np.random.seed(0)

n = 200
gender = ["Male", "Female"]
prod_category = ["Goods", "Service"]
names = [f"customer{i}" for i in range(1,n+1)]

data = {
    "CusomerID": range(1,n+1),
    "Names": names,
    "Gender": np.random.choice(gender, n),
    "PurchaseAmount": np.random.randint(100,501,n).astype(float),
    "PurchaseDate": pd.date_range("2025-01-01", periods=n, freq='180D'),
    "ProductCategory": np.random.choice(prod_category,n)
}

df = pd.DataFrame(data)

for col in ["PurchaseAmount", "ProductCategory"]:
        df.loc[df.sample(frac=0.1, random_state=1).index, col] = np.nan

df.head(20)

    CusomerID       Names  Gender  PurchaseAmount PurchaseDate ProductCategory
0           1   customer1    Male           225.0   2025-01-01         Service
1           2   customer2  Female           358.0   2025-06-30           Goods
2           3   customer3  Female           103.0   2025-12-27           Goods
3           4   customer4    Male           194.0   2026-06-25         Service
4           5   customer5  Female             NaN   2026-12-22             NaN
5           6   customer6  Female           463.0   2027-06-20         Service
6           7   customer7  Female           369.0   2027-12-17           Goods
7           8   customer8  Female           468.0   2028-06-14           Goods
8           9   customer9  Female           396.0   2028-12-11         Service
9          10  customer10  Female           428.0   2029-06-09           Goods
10         11  customer11  Female           119.0   2029-12-06           Goods
11         12  customer12    Male             NaN   2030-06-04             NaN
12         13  customer13    Male           428.0   2030-12-01           Goods
13         14  customer14  Female           348.0   2031-05-30           Goods
14         15  customer15    Male           280.0   2031-11-26           Goods
15         16  customer16    Male           423.0   2032-05-24           Goods
16         17  customer17    Male           417.0   2032-11-20           Goods
17         18  customer18    Male           370.0   2033-05-19           Goods
18         19  customer19    Male             NaN   2033-11-15             NaN
19         20  customer20  Female           360.0   2034-05-14           Goods

Create a Series of even numbers from 2 to 20 and calculate the sum of its values.

In [ ]:
s = pd.Series(np.arange(2,21))
s

0      2
1      3
2      4
3      5
4      6
5      7
6      8
7      9
8     10
9     11
10    12
11    13
12    14
13    15
14    16
15    17
16    18
17    19
18    20
dtype: int64

In [ ]:
print(s.sum())

np.int64(209)

Create a DataFrame with columns Name, Age, Salary, and Dept. Introduce at least two missing values (one in Salary, one in Dept).

In [ ]:
data = {
    "Name": ["Ali", "Sara", "John", "Meera", "David", "Sophia", "Tom"],
    "Age": [25, 30, 35, 28, np.nan, 40, 22],
    "Salary": [50000, 60000, np.nan, 72000, 58000, 90000, 45000],
    "Dept": ["HR", "Finance", "IT", np.nan, "Finance", "IT", "HR"]
}

df = pd.DataFrame(data)
df

     Name   Age   Salary     Dept
0     Ali  25.0  50000.0       HR
1    Sara  30.0  60000.0  Finance
2    John  35.0      NaN       IT
3   Meera  28.0  72000.0      NaN
4   David   NaN  58000.0  Finance
5  Sophia  40.0  90000.0       IT
6     Tom  22.0  45000.0       HR

In [ ]:
df[df["Age"] > df["Age"].mean()]

     Name   Age   Salary Dept
2    John  35.0      NaN   IT
5  Sophia  40.0  90000.0   IT

From the DataFrame, select the last 3 rows and only the Name and Salary columns.

In [ ]:
df[["Name","Salary"]].tail(3)

     Name   Salary
4   David  58000.0
5  Sophia  90000.0
6     Tom  45000.0

In [ ]:
df[(df["Dept"] == "IT") | (df["Salary"] > 70000)]

     Name   Age   Salary Dept
2    John  35.0      NaN   IT
3   Meera  28.0  72000.0  NaN
5  Sophia  40.0  90000.0   IT

Add a new column Tax = 15% of Salary, but only for employees with Salary > 60,000; others should have 0.

In [ ]:
df["Tax"] = np.where(df["Salary"] > 60000, df["Salary"] * 0.15, 0)
df

     Name   Age   Salary     Dept      Tax
0     Ali  25.0  50000.0       HR      0.0
1    Sara  30.0  60000.0  Finance      0.0
2    John  35.0      NaN       IT      0.0
3   Meera  28.0  72000.0      NaN  10800.0
4   David   NaN  58000.0  Finance      0.0
5  Sophia  40.0  90000.0       IT  13500.0
6     Tom  22.0  45000.0       HR      0.0

In [ ]:
df["Tax"] = df["Salary"].apply(lambda x: x * 0.15 if x > 60000 else 0 )
df

     Name   Age   Salary     Dept      Tax
0     Ali  25.0  50000.0       HR      0.0
1    Sara  30.0  60000.0  Finance      0.0
2    John  35.0      NaN       IT      0.0
3   Meera  28.0  72000.0      NaN  10800.0
4   David   NaN  58000.0  Finance      0.0
5  Sophia  40.0  90000.0       IT  13500.0
6     Tom  22.0  45000.0       HR      0.0

Fill missing values in Dept with "General", and missing Salary with the median salary

In [ ]:
df.fillna({
    "Salary":df["Salary"].mean(),
    "Dept": "General"
}
)

KeyError: 'Salary'

In [ ]:
df = df["Dept"].fillna("General")

In [ ]:
df["Salary"] = df["Salary"].fillna(df["Salary"].mean())

KeyError: 'Salary'

In [ ]:
df

     Name   Age   Salary     Dept      Tax
0     Ali  25.0  50000.0       HR      0.0
1    Sara  30.0  60000.0  Finance      0.0
2    John  35.0      NaN       IT      0.0
3   Meera  28.0  72000.0      NaN  10800.0
4   David   NaN  58000.0  Finance      0.0
5  Sophia  40.0  90000.0       IT  13500.0
6     Tom  22.0  45000.0       HR      0.0

In [ ]:
np.random.seed(0)


data = {
    "Name": ["Ali", "Sara", "John", "Meera", "David", "Sophia", "Tom", "Rina", "Alex", "Maya"],
    "Age": [25, 30, 35, 28, np.nan, 40, 22, 31, 29, 27],
    "Salary": [50000, 60000, np.nan, 72000, 58000, 90000, 45000, 62000, 55000, np.nan],
    "Dept": ["HR", "Finance", "IT", np.nan, "Finance", "IT", "HR", "IT", "Finance", "HR"]
}

df = pd.DataFrame(data)
df

     Name   Age   Salary     Dept
0     Ali  25.0  50000.0       HR
1    Sara  30.0  60000.0  Finance
2    John  35.0      NaN       IT
3   Meera  28.0  72000.0      NaN
4   David   NaN  58000.0  Finance
5  Sophia  40.0  90000.0       IT
6     Tom  22.0  45000.0       HR
7    Rina  31.0  62000.0       IT
8    Alex  29.0  55000.0  Finance
9    Maya  27.0      NaN       HR

In [ ]:
df["Dept"].sort_values()

1    Finance
4    Finance
8    Finance
0         HR
6         HR
9         HR
2         IT
5         IT
7         IT
3        NaN
Name: Dept, dtype: object

Sort the DataFrame by Department, then by Salary descending.

In [ ]:
df["Salary"].sort_values(ascending=False)

5    90000.0
3    72000.0
7    62000.0
1    60000.0
4    58000.0
8    55000.0
0    50000.0
6    45000.0
2        NaN
9        NaN
Name: Salary, dtype: float64

In [ ]:
df[["Name","Salary"]].nlargest(3,"Salary")

     Name   Salary
5  Sophia  90000.0
3   Meera  72000.0
7    Rina  62000.0

Calculate the average Salary per Department using groupby.

In [ ]:
df.groupby("Dept")["Salary"].mean()

Dept
Finance    57666.666667
HR         47500.000000
IT         76000.000000
Name: Salary, dtype: float64

Add a new column Bonus = 10% of Salary and sort the DataFrame by Bonus.

In [ ]:
df["Bonus"] = df["Salary"] * 0.1
df["Bonus"].sort_values()

6    4500.0
0    5000.0
8    5500.0
4    5800.0
1    6000.0
7    6200.0
3    7200.0
5    9000.0
2       NaN
9       NaN
Name: Bonus, dtype: float64

Filter employees with Salary > 60000 and sort them by Age.

In [ ]:
high_salary = df[df["Salary"] > 60000]
high_salary.sort_values("Age")

     Name   Age   Salary Dept   Bonus
3   Meera  28.0  72000.0  NaN  7200.0
7    Rina  31.0  62000.0   IT  6200.0
5  Sophia  40.0  90000.0   IT  9000.0

Fill missing Salary values with the median and then sort by Salary.

In [ ]:
df["Salary"] = df["Salary"].fillna(df["Salary"].median())

In [ ]:
print(df["Salary"].sort_values())

6    45000.0
0    50000.0
8    55000.0
4    58000.0
9    59000.0
2    59000.0
1    60000.0
7    62000.0
3    72000.0
5    90000.0
Name: Salary, dtype: float64

Drop rows where more than 1 column has missing values, then sort by Department.

In [ ]:
df.dropna(thresh=1)

     Name   Age   Salary     Dept   Bonus
0     Ali  25.0  50000.0       HR  5000.0
1    Sara  30.0  60000.0  Finance  6000.0
2    John  35.0  59000.0       IT     NaN
3   Meera  28.0  72000.0      NaN  7200.0
4   David   NaN  58000.0  Finance  5800.0
5  Sophia  40.0  90000.0       IT  9000.0
6     Tom  22.0  45000.0       HR  4500.0
7    Rina  31.0  62000.0       IT  6200.0
8    Alex  29.0  55000.0  Finance  5500.0
9    Maya  27.0  59000.0       HR     NaN

In [ ]:
df["Dept"].sort_values()

1    Finance
4    Finance
8    Finance
0         HR
6         HR
9         HR
2         IT
5         IT
7         IT
3        NaN
Name: Dept, dtype: object

In [ ]:
np.random.seed(0)

df["Performance"] = np.random.randint(1,6, size=len(df))
df

     Name   Age   Salary     Dept   Bonus  Performace  Performance
0     Ali  25.0  50000.0       HR  5000.0           5            5
1    Sara  30.0  60000.0  Finance  6000.0           1            1
2    John  35.0  59000.0       IT     NaN           4            4
3   Meera  28.0  72000.0      NaN  7200.0           4            4
4   David   NaN  58000.0  Finance  5800.0           4            4
5  Sophia  40.0  90000.0       IT  9000.0           2            2
6     Tom  22.0  45000.0       HR  4500.0           4            4
7    Rina  31.0  62000.0       IT  6200.0           3            3
8    Alex  29.0  55000.0  Finance  5500.0           5            5
9    Maya  27.0  59000.0       HR     NaN           1            1

In [ ]:
df.drop("Performace", axis=1, inplace=True)
df

     Name   Age   Salary     Dept   Bonus  Performance
0     Ali  25.0  50000.0       HR  5000.0            5
1    Sara  30.0  60000.0  Finance  6000.0            1
2    John  35.0  59000.0       IT     NaN            4
3   Meera  28.0  72000.0      NaN  7200.0            4
4   David   NaN  58000.0  Finance  5800.0            4
5  Sophia  40.0  90000.0       IT  9000.0            2
6     Tom  22.0  45000.0       HR  4500.0            4
7    Rina  31.0  62000.0       IT  6200.0            3
8    Alex  29.0  55000.0  Finance  5500.0            5
9    Maya  27.0  59000.0       HR     NaN            1

In [ ]:
sorted_performance = df.groupby("Dept", group_keys=False).apply(lambda x: x.nlargest(2,"Performance"))
sorted_performance

C:\Users\moham\AppData\Local\Temp\ipykernel_23468\3073673508.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  sorted_performance = df.groupby("Dept", group_keys=False).apply(lambda x: x.nlargest(2,"Performance"))

    Name   Age   Salary     Dept   Bonus  Performance
8   Alex  29.0  55000.0  Finance  5500.0            5
4  David   NaN  58000.0  Finance  5800.0            4
0    Ali  25.0  50000.0       HR  5000.0            5
6    Tom  22.0  45000.0       HR  4500.0            4
2   John  35.0  59000.0       IT     NaN            4
7   Rina  31.0  62000.0       IT  6200.0            3

In [ ]:
sorted_performance = df.groupby("Dept",group_keys=False).apply(lambda x: x.nlargest(2,"Performance"))
sorted_performance

C:\Users\moham\AppData\Local\Temp\ipykernel_23468\3217193380.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  sorted_performance = df.groupby("Dept",group_keys=False).apply(lambda x: x.nlargest(2,"Performance"))

    Name   Age   Salary     Dept   Bonus  Performance
8   Alex  29.0  55000.0  Finance  5500.0            5
4  David   NaN  58000.0  Finance  5800.0            4
0    Ali  25.0  50000.0       HR  5000.0            5
6    Tom  22.0  45000.0       HR  4500.0            4
2   John  35.0  59000.0       IT     NaN            4
7   Rina  31.0  62000.0       IT  6200.0            3

In [ ]:
nameS_M = df["Name"].str.startswith(("S","M"))
df[nameS_M]

     Name   Age   Salary     Dept   Bonus  Performance
1    Sara  30.0  60000.0  Finance  6000.0            1
3   Meera  28.0  72000.0      NaN  7200.0            4
5  Sophia  40.0  90000.0       IT  9000.0            2
9    Maya  27.0  59000.0       HR     NaN            1

In [ ]:
import pandas as pd

# Sample dataset
data = {
    "Dept": ["IT", "IT", "HR", "HR", "Finance", "Finance"],
    "Employee": ["A", "B", "C", "D", "E", "F"],
    "Month": ["Jan", "Jan", "Jan", "Feb", "Feb", "Feb"],
    "Salary": [5000, 6000, 5500, 5200, 7000, 7100]
}

df = pd.DataFrame(data)
df

      Dept Employee Month  Salary
0       IT        A   Jan    5000
1       IT        B   Jan    6000
2       HR        C   Jan    5500
3       HR        D   Feb    5200
4  Finance        E   Feb    7000
5  Finance        F   Feb    7100

In [ ]:

pivot_table_df = df.pivot_table(
    index="Dept", 
    columns="Month", 
    values="Salary", 
    aggfunc="mean"   # or "sum", "max"
)
print(pivot_table_df)

Month       Feb     Jan
Dept
Finance  7050.0     NaN
HR       5200.0  5500.0
IT          NaN  5500.0

In [ ]:
data = {
    "Dept": ["HR", "IT", "Finance"],
    "Month": ["Jan", "Feb", "Mar"],
    "Salary": [40000, 60000, 55000]
}

df = pd.DataFrame(data)
df

      Dept Month  Salary
0       HR   Jan   40000
1       IT   Feb   60000
2  Finance   Mar   55000

In [ ]:
df.pivot(index="Dept", columns="Month", values="Salary")

Month        Feb      Jan      Mar
Dept
Finance      NaN      NaN  55000.0
HR           NaN  40000.0      NaN
IT       60000.0      NaN      NaN

In [ ]:
df = pd.DataFrame({
    "Dept": ["HR", "IT"],
    "Jan_Salary": [40000, 50000],
    "Feb_Salary": [42000, 52000]
})

df

  Dept  Jan_Salary  Feb_Salary
0   HR       40000       42000
1   IT       50000       52000

In [ ]:
pd.melt(df, id_vars=["Dept"], value_vars=["Jan_Salary", "Feb_Salary"], var_name="Month", value_name="Salary")

  Dept       Month  Salary
0   HR  Jan_Salary   40000
1   IT  Jan_Salary   50000
2   HR  Feb_Salary   42000
3   IT  Feb_Salary   52000

In [ ]:
df_sales = pd.DataFrame({
    "Dept": ["HR", "IT", "Finance"],
    "Jan_Sales": [2000, 4000, 3000],
    "Feb_Sales": [2200, 4200, 3100],
    "Mar_Sales": [2500, 4500, 3200]
})

df_sales

      Dept  Jan_Sales  Feb_Sales  Mar_Sales
0       HR       2000       2200       2500
1       IT       4000       4200       4500
2  Finance       3000       3100       3200

In [ ]:
pd.melt(df_sales, id_vars=["Dept"], value_vars=["Jan_Sales","Feb_Sales", "Mar_Sales"], var_name="Month", value_name="Sales")

      Dept      Month  Sales
0       HR  Jan_Sales   2000
1       IT  Jan_Sales   4000
2  Finance  Jan_Sales   3000
3       HR  Feb_Sales   2200
4       IT  Feb_Sales   4200
5  Finance  Feb_Sales   3100
6       HR  Mar_Sales   2500
7       IT  Mar_Sales   4500
8  Finance  Mar_Sales   3200

In [ ]:
df_scores = pd.DataFrame({
    "Student": ["Alice", "Bob", "Charlie"],
    "Math": [85, 90, 78],
    "Science": [92, 88, 80],
    "English": [88, 84, 75]
})

df_scores

   Student  Math  Science  English
0    Alice    85       92       88
1      Bob    90       88       84
2  Charlie    78       80       75

In [ ]:
pd.melt(df_scores, id_vars=["Student"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

   Student  Subject  Score
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     78
3    Alice  Science     92
4      Bob  Science     88
5  Charlie  Science     80
6    Alice  English     88
7      Bob  English     84
8  Charlie  English     75

In [ ]:
df_weather = pd.DataFrame({
    "City": ["Delhi", "Mumbai", "Chennai"],
    "Jan_Temp": [15, 22, 25],
    "Feb_Temp": [18, 24, 27],
    "Mar_Temp": [25, 28, 30]
})

df

  Dept  Jan_Salary  Feb_Salary
0   HR       40000       42000
1   IT       50000       52000

In [ ]:
pd.melt(df_weather, id_vars=["City"], value_vars=["Jan_Temp", "Feb_Temp", "Mar_Temp"], var_name="Month", value_name="Temperature")

      City     Month  Temperature
0    Delhi  Jan_Temp           15
1   Mumbai  Jan_Temp           22
2  Chennai  Jan_Temp           25
3    Delhi  Feb_Temp           18
4   Mumbai  Feb_Temp           24
5  Chennai  Feb_Temp           27
6    Delhi  Mar_Temp           25
7   Mumbai  Mar_Temp           28
8  Chennai  Mar_Temp           30

In [ ]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Dept": ["HR", "IT", "Finance"],
    "Salary": [40000, 50000, 55000]
})

df

      Name     Dept  Salary
0    Alice       HR   40000
1      Bob       IT   50000
2  Charlie  Finance   55000

In [ ]:
df.replace({"HR": "Humen Resource", "IT": "Information Technology"})

      Name                    Dept  Salary
0    Alice          Humen Resource   40000
1      Bob  Information Technology   50000
2  Charlie                 Finance   55000

In [ ]:
df

      Name            Dept  Salary
0    Alice  Humen Resource   40000
1      Bob              IT   50000
2  Charlie         Finance   55000

In [ ]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Alice", "Charlie", "Bob"],
    "Dept": ["HR", "IT", "HR", "Finance", "IT"],
    "Salary": [40000, 50000, 40000, 55000, 50000]
})

df

      Name     Dept  Salary
0    Alice       HR   40000
1      Bob       IT   50000
2    Alice       HR   40000
3  Charlie  Finance   55000
4      Bob       IT   50000

In [ ]:
df[df.duplicated()]

    Name Dept  Salary
2  Alice   HR   40000
4    Bob   IT   50000

In [ ]:
df.drop_duplicates()

      Name     Dept  Salary
0    Alice       HR   40000
1      Bob       IT   50000
3  Charlie  Finance   55000

In [ ]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob"],
    "Math": [85, 90],
    "Science": [88, 92]
})

df

    Name  Math  Science
0  Alice    85       88
1    Bob    90       92

In [ ]:
stacked = df.set_index("Name").stack()
stacked

Name
Alice  Math       85
       Science    88
Bob    Math       90
       Science    92
dtype: int64

In [ ]:
unstacked =stacked.unstack()
unstacked

       Math  Science
Name
Alice    85       88
Bob      90       92

In [ ]:
unstacked.reset_index()

    Name  Math  Science
0  Alice    85       88
1    Bob    90       92

In [ ]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Salary": [50000, 60000, 70000]
})

df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [ ]:
df.drop("Age", axis=1)

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000

In [ ]:
df.pop("Salary")

0    50000
1    60000
2    70000
Name: Salary, dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [ ]:
df.value_counts()

Name     Age
Alice    25     1
Bob      30     1
Charlie  35     1
Name: count, dtype: int64

In [ ]:
data = [["naeef",23,"malappuram"],
        ["akash",23,"kozhikode"]]

cols = ["Name","Age","Place"]

df = pd.DataFrame(data, columns=cols)
df

    Name  Age       Place
0  naeef   23  malappuram
1  akash   23   kozhikode

In [ ]:
df.value_counts()

Name   Age  Place
akash  23   kozhikode     1
naeef  23   malappuram    1
Name: count, dtype: int64

In [ ]:
data = {
    "Name": ["Asha", "Ravi", "Meera", "Anil", "Kiran", "Divya"],
    "Age": [23, 29, 21, 32, 27, 24],
    "Department": ["HR", "IT", "Finance", "IT", "Finance", "HR"],
    "Salary": [25000, 48000, 32000, 52000, 45000, 27000],
}
df = pd.DataFrame(data)
df

    Name  Age Department  Salary
0   Asha   23         HR   25000
1   Ravi   29         IT   48000
2  Meera   21    Finance   32000
3   Anil   32         IT   52000
4  Kiran   27    Finance   45000
5  Divya   24         HR   27000

In [ ]:
df.query("Age > 25")

    Name  Age Department  Salary
1   Ravi   29         IT   48000
3   Anil   32         IT   52000
4  Kiran   27    Finance   45000

In [ ]:
df.query("Department == 'IT'")

   Name  Age Department  Salary
1  Ravi   29         IT   48000
3  Anil   32         IT   52000

In [ ]:
df.query("Salary < 30000")

    Name  Age Department  Salary
0   Asha   23         HR   25000
5  Divya   24         HR   27000

In [ ]:
df.query("Department == 'Finance' and Age < 30")

    Name  Age Department  Salary
2  Meera   21    Finance   32000
4  Kiran   27    Finance   45000

In [ ]:
df.query("Salary > 40000")[["Name","Salary"]]

    Name  Salary
1   Ravi   48000
3   Anil   52000
4  Kiran   45000

In [ ]:
df.query("Age >= 22 and Age <=28")

    Name  Age Department  Salary
0   Asha   23         HR   25000
4  Kiran   27    Finance   45000
5  Divya   24         HR   27000

In [ ]:
df[df["Name"].str.startswith("A")]

   Name  Age Department  Salary
0  Asha   23         HR   25000
3  Anil   32         IT   52000

In [35]:
df = pd.DataFrame({
    "EmpID": [101, 102, 103, 104, 105],
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Dept": ["IT", "HR", "IT", "Finance", "HR"],
    "Salary": [50000, 60000, np.nan, 70000, 65000],
    "Bonus": [5000, None, 4000, None, 6000]
})

df

   EmpID     Name     Dept   Salary   Bonus
0    101    Alice       IT  50000.0  5000.0
1    102      Bob       HR  60000.0     NaN
2    103  Charlie       IT      NaN  4000.0
3    104    David  Finance  70000.0     NaN
4    105      Eva       HR  65000.0  6000.0

In [40]:
df.interpolate(method='polynomial', order=2)

C:\Users\moham\AppData\Local\Temp\ipykernel_23988\2788194931.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method='polynomial', order=2)

   EmpID     Name     Dept   Salary   Bonus
0    101    Alice       IT  50000.0  5000.0
1    102      Bob       HR  60000.0  4125.0
2    103  Charlie       IT  67500.0  4000.0
3    104    David  Finance  70000.0  4625.0
4    105      Eva       HR  65000.0  6000.0

In [ ]:
df.replace('IT', 'Tech')

   EmpID     Name     Dept  Salary   Bonus
0    101    Alice     Tech   50000  5000.0
1    102      Bob       HR   60000     NaN
2    103  Charlie     Tech   55000  4000.0
3    104    David  Finance   70000     NaN
4    105      Eva       HR   65000  6000.0

In [ ]:
df.replace('Eva', 'Evelyn')

   EmpID     Name     Dept  Salary   Bonus
0    101    Alice       IT   50000  5000.0
1    102      Bob       HR   60000     NaN
2    103  Charlie       IT   55000  4000.0
3    104    David  Finance   70000     NaN
4    105   Evelyn       HR   65000  6000.0

In [ ]:
df["Salary"].replace({50000:55000, 52000:5800})

0    55000
1    60000
2    55000
3    70000
4    65000
Name: Salary, dtype: int64

In [ ]:
df["Bonus"].fillna("Not Assigned")

0          5000.0
1    Not Assigned
2          4000.0
3    Not Assigned
4          6000.0
Name: Bonus, dtype: object

In [ ]:
df.loc[df["Name"] == "Bob", "Salary"] = 62000

In [ ]:
df

   EmpID     Name     Dept  Salary   Bonus
0    101    Alice       IT   50000  5000.0
1    102      Bob       HR   62000     NaN
2    103  Charlie       IT   55000  4000.0
3    104    David  Finance   70000     NaN
4    105      Eva       HR   65000  6000.0

In [ ]:
df.loc[df["EmpID"] == 104,"Dept"] = "Management"

In [ ]:
df

   EmpID     Name        Dept  Salary   Bonus
0    101    Alice          IT   50000  5000.0
1    102      Bob          HR   62000     NaN
2    103  Charlie          IT   55000  4000.0
3    104    David  Management   70000     NaN
4    105      Eva          HR   65000  6000.0

In [ ]:
df.loc[df["Salary"] < 60000, "Salary"] += 1000

In [ ]:
df

   EmpID   Name        Dept  Salary    Bonus
0  51000  63000       56000   71000  66000.0
1    102    Bob          HR   62000      NaN
2  51000  63000       56000   71000  66000.0
3    104  David  Management   70000      NaN
4    105    Eva          HR   65000   6000.0

In [42]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "Age": [25, 30, 35, 40, 28, 50],
    "Department": ["IT", "HR", "Sales", "IT", "HR", "Sales"],
    "Salary": [50000, 60000, 55000, 70000, 30000, 80000]
}

df = pd.DataFrame(data)
df

      Name  Age Department  Salary
0    Alice   25         IT   50000
1      Bob   30         HR   60000
2  Charlie   35      Sales   55000
3    David   40         IT   70000
4      Eva   28         HR   30000
5    Frank   50      Sales   80000

In [20]:
df["Name"]

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
Name: Name, dtype: object

In [21]:
df.iloc[:3]

      Name  Age Department  Salary
0    Alice   25         IT   50000
1      Bob   30         HR   60000
2  Charlie   35      Sales   55000

In [23]:
df[df["Salary"] > 60000]

    Name  Age Department  Salary
3  David   40         IT   70000
5  Frank   50      Sales   80000

In [24]:
df.loc[2:4, ['Name', 'Salary']]

      Name  Salary
2  Charlie   55000
3    David   70000
4      Eva   30000

In [30]:
df.iloc[-1]

Name          Frank
Age              50
Department    Sales
Salary        80000
Name: 5, dtype: object

In [31]:
df.loc[df.index[-1]]

Name          Frank
Age              50
Department    Sales
Salary        80000
Name: 5, dtype: object

In [44]:
df.loc[df["Salary"] < 40000, "Salary"] = 40000

In [45]:
df

      Name  Age Department  Salary
0    Alice   25         IT   50000
1      Bob   30         HR   60000
2  Charlie   35      Sales   55000
3    David   40         IT   70000
4      Eva   28         HR   40000
5    Frank   50      Sales   80000

In [46]:
df.replace('IT', 'Tech')

      Name  Age Department  Salary
0    Alice   25       Tech   50000
1      Bob   30         HR   60000
2  Charlie   35      Sales   55000
3    David   40       Tech   70000
4      Eva   28         HR   40000
5    Frank   50      Sales   80000

In [47]:
df.replace({'HR': 'HUman R', 'Sales': 'Business'})

      Name  Age Department  Salary
0    Alice   25         IT   50000
1      Bob   30    HUman R   60000
2  Charlie   35   Business   55000
3    David   40         IT   70000
4      Eva   28    HUman R   40000
5    Frank   50   Business   80000

In [50]:
df.loc[2,"Salary"] = 60000000

In [51]:
df

      Name  Age Department    Salary
0    Alice   25         IT     50000
1      Bob   30         HR     60000
2  Charlie   35      Sales  60000000
3    David   40         IT     70000
4      Eva   28         HR     40000
5    Frank   50      Sales     80000

In [54]:
df.groupby("Department")["Name"].count()

Department
HR       2
IT       2
Sales    2
Name: Name, dtype: int64

In [56]:
df.loc[df["Name"] == "Eva", "Name"] = 'Bob'

In [57]:
df

      Name  Age Department    Salary
0    Alice   25         IT     50000
1      Bob   30         HR     60000
2  Charlie   35      Sales  60000000
3    David   40         IT     70000
4      Bob   28         HR     40000
5    Frank   50      Sales     80000

In [58]:
df.groupby("Department")["Name"].count()

Department
HR       2
IT       2
Sales    2
Name: Name, dtype: int64

In [59]:
df.shape

(6, 4)

In [60]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [61]:
df.columns

Index(['Name', 'Age', 'Department', 'Salary'], dtype='object')

In [62]:
df1 = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Department": ["IT", "HR", "Sales"]
})

df1

      Name  Age Department
0    Alice   25         IT
1      Bob   30         HR
2  Charlie   35      Sales

In [63]:
df2 = pd.DataFrame({
    "Name": ["David", "Eva"],
    "Age": [40, 28],
    "Department": ["IT", "HR"]
})
df2

    Name  Age Department
0  David   40         IT
1    Eva   28         HR

In [66]:
pd.concat((df1,df2), axis=1)

      Name  Age Department   Name   Age Department
0    Alice   25         IT  David  40.0         IT
1      Bob   30         HR    Eva  28.0         HR
2  Charlie   35      Sales    NaN   NaN        NaN

In [68]:
df1.set_index("Name").stack()

Name
Alice    Age              25
         Department       IT
Bob      Age              30
         Department       HR
Charlie  Age              35
         Department    Sales
dtype: object

In [ ]:
df1.join(df2, on="Age", lsuffix="leddddft", rsuffix="Right")

   Age Nameleft  Ageleft Departmentleft NameRight  AgeRight DepartmentRight
0   25    Alice       25             IT       NaN       NaN             NaN
1   30      Bob       30             HR       NaN       NaN             NaN
2   35  Charlie       35          Sales       NaN       NaN             NaN

In [80]:
df_emp = pd.DataFrame({
    "EmpID": [101, 102, 103, 104],
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "DeptID": [1, 2, 1, 3]
})

# Department DataFrame
df_dept = pd.DataFrame({
    "DeptID": [1, 2, 3,4],
    "Department": ["HR", "IT","JJJHJ", "Finance"]
})

In [76]:
df_emp

   EmpID     Name  DeptID
0    101    Alice       1
1    102      Bob       2
2    103  Charlie       1
3    104    David       3

In [81]:
df_dept

   DeptID Department
0       1         HR
1       2         IT
2       3      JJJHJ
3       4    Finance

In [85]:
df_emp.join(df_dept, lsuffix="LEft", rsuffix="Right", how='inner')

   EmpID     Name  DeptIDLEft  DeptIDRight Department
0    101    Alice           1            1         HR
1    102      Bob           2            2         IT
2    103  Charlie           1            3      JJJHJ
3    104    David           3            4    Finance

In [88]:
df_emp = pd.DataFrame({
    "EmpID": [101, 102, 103, 104],
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "DeptID": [1, 2, 1, 3]
})

df_emp

   EmpID     Name  DeptID
0    101    Alice       1
1    102      Bob       2
2    103  Charlie       1
3    104    David       3

In [90]:
df_emp.rename(columns={'Name':'Names', 'DeptID':'DepartmentID'})

   EmpID    Names  DepartmentID
0    101    Alice             1
1    102      Bob             2
2    103  Charlie             1
3    104    David             3